app/controllers/articles_controller.rb

  def update
    # raise params.inspect : commented out
    # 1. Query the DB
    @article = Article.find(params[:id])

    # 2. Store the query in an instance variable
    # 3. Update values passed from form
    # 4. Save
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-04-16 17:24:33.317719"], ["id", 1]]